module.exports = {
  /**
   * 模拟接口返回数据
   * @param  {string}  selectType    比较类型 (必填) 0-按月 1-按年
   */
  'POST /mockTest/mockTestUrl': (req, res) => {
    const json = {
      returnCode: "0",
      errorNo: "0",
      total: -1,
      totalCount: -1,
      errorInfo: "",
      rows: [{
        jsonString: JSON.stringify({
          xLineText: req.body.selectType === '0' ? ['1月', '2月', '3月', '4月', '5月', '6月'] : ['2019', '2020', '2021', '2022', '2023', '2024'],
          categories: ['理财', '基金', '信托', '保险', '贵金属', '公募投顾'],
          echartData: req.body.selectType === '0' ? [
            ["120", "132", "101", "134", "90", "230"],
            ["320", "182", "191", "234", "290", "330"],
            ["150", "232", "401", "154", "190", "430"],
            ["320", "332", "301", "334", "390", "230"],
            ["50", "232", "401", "334", "400", "500"],
            ["120", "312", "230", "180", "190", "330"],
          ] : [
            ["220", "132", "154", "138", "90", "210"],
            ["420", "182", "191", "222", "160", "108"],
            ["250", "232", "303", "154", "280", "363"],
            ["420", "332", "301", "334", "270", "50"],
            ["150", "232", "401", "334", "400", "177"],
            ["220", "312", "230", "180", "190", "188"],
          ],
          // 中间图标数据
          name: '非息净收入',
          totalValue: '1,021',
          totalUint: '万元',
        })
      }]
    }
    res.send(json)
  }
}